const { v4: uuidv4 } = require('uuid');

export const majorList=[{
    id: uuidv4(),
    name:'هندسة التخطيط والتصميم الحضري',
    tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },
  {
    id:  uuidv4(),
  name: 'الهندسة الكهربائية ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']

  },
  {
    id:  uuidv4(),
  name: 'الهندسة المدنية ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']

  },{
    id:  uuidv4(),
  name: 'الهندسة المعمارية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة الميكانيكية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },
  {
    id:  uuidv4(),
  name: 'هندسة الميكاترونيكس',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة الحاسوب',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'علم الحاسوب ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']

  },{
    id:  uuidv4(),
  name: 'اللغة العربية وأدابها',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'اللغة الانجليزية وأدابها ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']


  },{
    id:  uuidv4(),
  name: 'اللغة الانجليزية وأدابها /فرعي الترجمة',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'اللغة الفرنسية ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: ' التاريخ والاثار ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الجغرافيا',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'رئيسي علم النفس /فرعي علم الاجتماع ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'رئيسي علم النفس /فرعي دراسات المرأة ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الصحافة والإعلام',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'اللغة الالمانية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'تعليم الاجتماعيات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'تعليم اللغة الانجليزية كلغة أجنبية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: ' دكتور صيدلي',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'التمريض',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'علاج النطق والسمع',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'المحاسبة',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']
  },{
    id:  uuidv4(),
  name: 'ادراة الاعمال',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']
  },{
    id:  uuidv4(),
  name: 'العلوم المالية والمصرفية ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']
  },{
  id:  uuidv4(),
  name: 'اقتصاد الاعمال',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
  id:  uuidv4(),
  name: 'التسويق',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
  id:  uuidv4(),
  name: 'الاقتصاد',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']
  },{
  id:  uuidv4(),
  name: 'العلوم المالية الاكتوارية',
  tawjihiTypes:['علمي']

  },{
  id:  uuidv4(),
  name: 'القانون',
  tawjihiTypes:['علمي','أدبي','شرعي']

  },{
  id:  uuidv4(),
  name: 'الادارة العامة',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
  id:  uuidv4(),
  name: 'العلوم السياسية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },
  {
  id:  uuidv4(),
  name: ' الاحياء والكيمياء الحيوية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','زراعي']

  },{
  id:  uuidv4(),
  name: 'الكيمياء',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','زراعي']

  },
  {
  id:  uuidv4(),
  name: 'الفيزياء',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','زراعي']

  },{
  id:  uuidv4(),
  name: 'الرياضيات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','زراعي']

  },{
    id:  uuidv4(),
  name: 'التصميم',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الفنون البصرية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الموسقى العربية والمعاصرة',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },



  //BZU stopped


  ,{
    id:  uuidv4(),
  name: 'الفيزياء وفرعي الكترونيات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']

  },{
    id:  uuidv4(),
  name: 'الأحياء البيوتكنولوجيا',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الرياضيات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الكيمياء',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'كيمياء تطبيقية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الفيزياء',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة المدنية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة المعمارية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة البناء',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة التخطيط العمراني',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة الميكانيكية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة الكيميائية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة الصناعية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة الحاسوب',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الهندسة الكهربائية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة الاتصالات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة الميكاترونكس',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة الطاقة والبيئة',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'هندسة علم المواد',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'علم الحاسوب',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'أنظمة المعلومات الإدارية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'أنظمة المعلومات الحاسوبية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'الشبكات وأمن المعلومات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']
  },{
    id:  uuidv4(),
  name: 'دكتور صيدلي',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'الصيدلة',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'العلوم الطبية الحيوية',
  tawjihiTypes:['علمي']
  },{
    id:  uuidv4(),
  name: 'العلوم الطبية الحيوية',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'القبالة',
  tawjihiTypes:['علمي']
  },{
    id:  uuidv4(),
  name: 'التمريض',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'البصريات',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'العلوم الطبية المخبرية',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'التصوير الطبي',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'علاج السمع والنطق ',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'العلاج الطبيعي ',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'الطب البيطري',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'الانتاج النباتي والوقاية',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'الانتاج الحيواني وصحة الحيوان',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'التغذية والتصنيع الغذائي',
  tawjihiTypes:['علمي']

  },{
    id:  uuidv4(),
  name: 'الاقتصاد',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'العلوم السياسية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الجغرافيا',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الخدمة االجتماعية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'علم النفس - فرعي إرشاد نفسي',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'إذاعة والتلفزيون',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الصحافة المكتوبة والالكترونية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'العلاقات العامة والاتصال',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'المحاسبة ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'ادارة الاعمال ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'العلوم المالية والمصرفية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'التسويق',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الموسيقى',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'التصميم الداخلي )ديكور',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'التصميم الجرافيكي',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'الرسم والتصوير',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'فن الخزف',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'معلم المرحلة األساسية العليا - تعليم الرياضيات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']

  },{
    id:  uuidv4(),
  name: 'معلم المرحلة األساسية العليا - تعليم اللغة العربية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'معلم المرحلة األساسية العليا - تعليم العلوم',
  tawjihiTypes:['علمي','صناعي','تكنولوجي']

  },{
    id:  uuidv4(),
  name: 'معلم المرحلة األساسية العليا - تعليم اللغة الإنجليزية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'معلم المرحلة األساسية العليا - تعليم التكنولوجي',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'معلم المرحلة األساسية العليا - تعليم االجتماعيات',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'التربية - التربية الرياضية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'التربية - رياض األطفال',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'اللغة الفرنسية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'السياحة والاثار',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'التاريخ',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'اللغة العربية وآدابها',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'اللغة الانجليزية وآدابها',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'فقه وتشريع',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'أصول الدين',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'مصارف اسلامية',
  tawjihiTypes:['علمي','صناعي','تكنولوجي','أدبي','زراعي','شرعي','فنادق','تجاري']

  },{
    id:  uuidv4(),
  name: 'القانون',
  tawjihiTypes:['علمي','أدبي','شرعي']

  }
  //Najah stoped
  
]