const { v4: uuidv4 } = require('uuid');

export const majorList=[{ id: uuidv4(),
    name:'هندسة التخطيط والتصميم الحضري'},
    {
        id:  uuidv4(),
      name: 'الهندسة الكهربائية ',
    
      },
      {
        id:  uuidv4(),
      name: 'الهندسة المدنية ',
    
      },{
        id:  uuidv4(),
      name: 'الهندسة المعمارية',
      },{
        id:  uuidv4(),
      name: 'الهندسة الميكانيكية',
      },
      
  {
    id:  uuidv4(),
  name: 'هندسة الميكاترونيكس',
  },{
    id:  uuidv4(),
  name: 'هندسة الحاسوب',
  },{
    id:  uuidv4(),
  name: 'علم الحاسوب ',

  },{
    id:  uuidv4(),
  name: 'اللغة العربية وأدابها',

  },{
    id:  uuidv4(),
  name: 'اللغة الانجليزية وأدابها ',


  },{
    id:  uuidv4(),
  name: 'اللغة الانجليزية وأدابها /فرعي الترجمة',

  },{
    id:  uuidv4(),
  name: 'اللغة الفرنسية ',

  },{
    id:  uuidv4(),
  name: ' التاريخ والاثار ',
  },{
    id:  uuidv4(),
  name: 'الجغرافيا',

  },{
    id:  uuidv4(),
  name: 'رئيسي علم النفس /فرعي علم الاجتماع ',

  },{
    id:  uuidv4(),
  name: 'رئيسي علم النفس /فرعي دراسات المرأة ',

  },{
    id:  uuidv4(),
  name: 'الصحافة والإعلام',

  },{
    id:  uuidv4(),
  name: 'اللغة الالمانية',

  },

]